{
  "<image>": 151646,
  "<|box_end|>": 151648,
  "<|box_start|>": 151647,
  "<|endoftext|>": 151643,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|md_end|>": 151652,
  "<|md_start|>": 151651,
  "<|ref_end|>": 151650,
  "<|ref_start|>": 151649,
  "<|txt_contd|>": 151653
}
